//Detection: SQL Server Brute Force Success (APT-Associated)
// Detects a high volume of failed logins immediately followed by successful authentication 
// to privileged SQL Server default accounts (e.g., 'sa').
//Advaced Persistent Threat Actor Association: 
//Cluster associated with China-nexus activity tracked as Silk Typhoon / Genesis Panda .
MITRE ATT&CK Mapping:
// Tactic: Initial Access (TA0001)
// Technique 1: T1078.001 - Valid Accounts: Default Accounts (Targets common/default high-privilege accounts).
// Technique 2: T1190 - Exploit Public-Facing Application (Login interface is exposed).
////////////////////Logic////////////////////
//Thresholds and variables pareameters
let failuretTreshold = 5;
let sucessThreshold = 1;
let timeWindow =5m;
let suspiciousAcccounts = dynamic(["sa", "sa_admin"]);//Default SQL admin accounts add relevant accounts here
let sqlServerPorts = dynamic([1433, 1434]);  //  SQL Server ports
//Checks Failure attemps
SecurityEvent
| where EventID in (18456, 4625, 4624, 18457)
| where TargetUserName  in~ (suspiciousAcccounts)
| where IpPort in (sqlServerPorts) or isempty(IpPort)
| extend LoginResult = case(
    EventID == 18456, "SQL_Failed",
    EventID == 4625, "Domain_Failed",
    "Other"
)
| summarize 
     FailureCount = countif(EventID == 18456 or EventID == 4625),
    SuccessCount = countif(EventID == 4624 or EventID == 18457),
    FailureEvents = make_set(iff(EventID in (18456, 4625), TimeGenerated, datetime(null))),
    SourceIPSet = make_set(IpAddress), 
    UniqueSourceIPs = dcount(IpAddress),
    FirstFailureTime = min(TimeGenerated),
    LastFailureTime = max(TimeGenerated)
    by TargetUserName, Computer, bin(TimeGenerated, timeWindow)
| where FailureCount >= failuretTreshold
//Checks Sucessfull Attemps and compares them
| join kind=inner(
SecurityEvent
  |where EventID in(18457, 4624)
  |where TargetUserName in (suspiciousAcccounts)
  | where IpPort in (sqlServerPorts) or isempty(IpPort)
  |summarize SuccessfulLoginTime = min(TimeGenerated) by TargetUserName, Computer   
) on TargetUserName,Computer
| extend 
  TimeBetweenFailureAndSuccess = SuccessfulLoginTime - LastFailureTime,
  SourceIPList  = strcat_array(SourceIPSet, ";"),
  RiskScore = case(
    FailureCount > 100, 95,
    FailureCount > 50, 85,
    FailureCount > failuretTreshold, 70,
    50
  ),
  AlertSeverity = case(
    FailureCount > 100, "Critical",
    FailureCount > 50, "High",
    FailureCount > failuretTreshold, "High", "Medium"
  )
| project 
    TimeGenerated,
    TargetUserName,
    Computer,
    FailureCount,
    SourceIPs = SourceIPList,
    UniqueSourceIPs,
    TimeBetweenFailureAndSuccess,
    RiskScore,
    AlertSeverity,
    FirstFailureTime,
    SuccessfulLoginTime,
    Alert = "SQL Server Brute Force Attack - SA Account Targeted"
| sort by FailureCount desc
