 union * // use a given table to scope to certain logs such us DeviceProcessEvents OR DeviceNetworkEvents
| where TimeGenerated > ago(24h)
| extend Ingestion_Time = ingestion_time()
| extend Source_to_Collection = _TimeReceived - TimeGenerated
| extend Collection_to_ingestion = Ingestion_Time - _TimeReceived
| extend End_to_end = Ingestion_Time - TimeGenerated
| extend Table = Type
| where End_to_end > 12h
| sort by End_to_end desc
| sort by Table
